In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = pd.DataFrame({'key1':['a','a','b','b','a'],
                  'key2':['one','two','one','two','one'],
                   'data1':np.random.randint(1,10,5),
                   'data2':np.random.randint(1,10,5)
                  })

In [4]:
df

   data1  data2 key1 key2
0      6      1    a  one
1      7      2    a  two
2      3      3    b  one
3      2      8    b  two
4      4      7    a  one

In [5]:
df['data1']

0    6
1    7
2    3
3    2
4    4
Name: data1, dtype: int32

In [7]:
df['data1'].groupby(df['key1']).mean()

key1
a    5.666667
b    2.500000
Name: data1, dtype: float64

In [8]:
df['data1'].groupby([df['key1'],df['key2']]).sum()

key1  key2
a     one     10
      two      7
b     one      3
      two      2
Name: data1, dtype: int32

In [9]:
df['data1'].groupby([df['key1'],df['key2']]).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [12]:
dict(list(df.groupby('key1')))

{'a':    data1  data2 key1 key2
 0      6      1    a  one
 1      7      2    a  two
 4      4      7    a  one, 'b':    data1  data2 key1 key2
 2      3      3    b  one
 3      2      8    b  two}

In [13]:
df.dtypes

data1     int32
data2     int32
key1     object
key2     object
dtype: object

In [14]:
df.groupby(df.dtypes,axis=1).sum()

   int32 object
0      7   aone
1      9   atwo
2      6   bone
3     10   btwo
4     11   aone

In [16]:
columns = pd.MultiIndex.from_arrays([['China','USA','China','USA','China'],
                                    ['A','A','B','C','B']],names=['country','index'])
df = pd.DataFrame(np.random.randint(1,10,(5,5)),columns=columns)
df

country China USA China USA China
index       A   A     B   C     B
0           5   2     2   7     7
1           1   1     7   6     4
2           9   6     4   4     8
3           1   3     3   6     7
4           7   4     5   8     9

In [19]:
df.groupby(level='country',axis=1)

In [20]:
df.groupby(level='country',axis=1).sum()

country  China  USA
0           14    9
1           12    7
2           21   10
3           11    9
4           21   12

In [21]:
df.groupby(level='index',axis=1).sum()

index   A   B  C
0       7   9  7
1       2  11  6
2      15  12  4
3       4  10  6
4      11  14  8

In [22]:
df = pd.DataFrame({'key1':['a','a','b','b','a'],
                  'key2':['one','two','one','two','one'],
                   'data1':np.random.randint(1,10,5),
                   'data2':np.random.randint(1,10,5)
                  })
df

   data1  data2 key1 key2
0      2      6    a  one
1      3      7    a  two
2      3      8    b  one
3      9      4    b  two
4      9      5    a  one

In [23]:
df.groupby('key1').sum()

      data1  data2
key1
a        14     18
b        12     12

In [24]:
df.groupby('key1').mean()

         data1  data2
key1
a     4.666667    6.0
b     6.000000    6.0

In [25]:
df.groupby('key1').min()

      data1  data2 key2
key1
a         2      5  one
b         3      4  one

In [26]:
df.groupby('key1').max()

      data1  data2 key2
key1
a         9      7  two
b         9      8  two

In [27]:
df.groupby('key1').describe()

               data1     data2
key1
a    count  3.000000  3.000000
     mean   4.666667  6.000000
     std    3.785939  1.000000
     min    2.000000  5.000000
     25%    2.500000  5.500000
     50%    3.000000  6.000000
     75%    6.000000  6.500000
     max    9.000000  7.000000
b    count  2.000000  2.000000
     mean   6.000000  6.000000
     std    4.242641  2.828427
     min    3.000000  4.000000
     25%    4.500000  5.000000
     50%    6.000000  6.000000
     75%    7.500000  7.000000
     max    9.000000  8.000000

In [28]:
grouped = df.groupby('key1')

In [32]:
grouped.agg(['std','mean','sum'])

         data1                   data2
           std      mean sum       std mean sum
key1
a     3.785939  4.666667  14  1.000000    6  18
b     4.242641  6.000000  12  2.828427    6  12

In [33]:
d = {'data1':'mean',
    'data2':'sum'}
grouped.agg(d)

      data2     data1
key1
a        18  4.666667
b        12  6.000000

In [35]:
k1_mean = df.groupby('key1').mean()

grouped.agg(d).reset_index()

In [36]:
k1_mean

         data1  data2
key1
a     4.666667    6.0
b     6.000000    6.0

In [37]:
k1_mean = df.groupby('key1').mean().add_prefix('mean_')

In [38]:
k1_mean

      mean_data1  mean_data2
key1
a       4.666667         6.0
b       6.000000         6.0

In [39]:
pd.merge(df ,k1_mean,left_on='key1',right_index=True)

   data1  data2 key1 key2  mean_data1  mean_data2
0      2      6    a  one    4.666667         6.0
1      3      7    a  two    4.666667         6.0
4      9      5    a  one    4.666667         6.0
2      3      8    b  one    6.000000         6.0
3      9      4    b  two    6.000000         6.0

In [40]:
k2_mean = df.groupby('key1').transform(np.mean).add_prefix('mean_')

In [41]:
k2_mean

   mean_data1  mean_data2
0    4.666667           6
1    4.666667           6
2    6.000000           6
3    6.000000           6
4    4.666667           6